src/InformationRegisters/дкл_ПользователиСкладов/дкл_ПользователиСкладов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>дкл_ПользователиСкладов</name>
  <resources>
    <name>Активна</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаСтатуса</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроверятьАвторизациюНаАСХ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Роль</name>
    <type>
      <types>EnumRef.дкл_РолиПользователей</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.дкл_Статусы</types>
    </type>
  </resources>
  <resources>
    <name>УправлениеЧерез1С</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>active_</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>firstName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>lastName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>login</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>middleName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>password</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>position</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>remotePassword</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>remoteAddress</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>remoteLogin</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>rfid</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>role</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>НастройкаСклада</name>
    <type>
      <types>CatalogRef.дкл_НастройкиСкладовЛифтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>userId</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/дкл_ПользователиСкладов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс   

Функция РеквизитыЗаполненыПередОтправкойВАСХ(НастройкаСклада, МассивПользователей = Неопределено, МассивUserId = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Истина;

	Для Каждого userId Из МассивUserId Цикл
		userId = Строка(userId);
	КонецЦикла;	
	
	ПроверяемыеРеквизиты = Новый Массив;
	ПроверяемыеРеквизиты.Добавить("userId");	
	ПроверяемыеРеквизиты.Добавить("login");	
	ПроверяемыеРеквизиты.Добавить("firstName");	
	ПроверяемыеРеквизиты.Добавить("lastName");	                                                             
	
	Если НЕ МассивПользователей = Неопределено Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	дкл_ПользователиСкладов.firstName КАК firstName,
		|	дкл_ПользователиСкладов.lastName КАК lastName,
		|	дкл_ПользователиСкладов.login КАК login,
		|	дкл_ПользователиСкладов.userId КАК userId,
		|	дкл_ПользователиСкладов.НастройкаСклада КАК НастройкаСклада,
		|	дкл_ПользователиСкладов.Пользователь КАК Пользователь
		|ИЗ
		|	РегистрСведений.дкл_ПользователиСкладов КАК дкл_ПользователиСкладов
		|ГДЕ
		|	дкл_ПользователиСкладов.НастройкаСклада = &НастройкаСклада
		|	И дкл_ПользователиСкладов.Пользователь В(&МассивПользователей)";
		
		Запрос.УстановитьПараметр("НастройкаСклада", НастройкаСклада);
		Запрос.УстановитьПараметр("МассивПользователей", МассивПользователей);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		
	ИначеЕсли НЕ МассивUserId = Неопределено Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	дкл_ПользователиСкладов.firstName КАК firstName,
		|	дкл_ПользователиСкладов.lastName КАК lastName,
		|	дкл_ПользователиСкладов.login КАК login,
		|	дкл_ПользователиСкладов.userId КАК userId,
		|	дкл_ПользователиСкладов.НастройкаСклада КАК НастройкаСклада,
		|	дкл_ПользователиСкладов.Пользователь КАК Пользователь
		|ИЗ
		|	РегистрСведений.дкл_ПользователиСкладов КАК дкл_ПользователиСкладов
		|ГДЕ
		|	дкл_ПользователиСкладов.НастройкаСклада = &НастройкаСклада
		|	И дкл_ПользователиСкладов.userId В(&МассивUserId)";
		
		Запрос.УстановитьПараметр("НастройкаСклада", НастройкаСклада);
		Запрос.УстановитьПараметр("МассивUserId", МассивUserId);
		
	КонецЕсли;

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	РеквизитыРегистра = Метаданные.РегистрыСведений.дкл_ПользователиСкладов.Реквизиты;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл                                
		
		Для Каждого Реквизит Из ПроверяемыеРеквизиты Цикл
			Если НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи[Реквизит]) Тогда
				НайденныйРеквизит = РеквизитыРегистра.Найти(Реквизит);
				Если НайденныйРеквизит = Неопределено Тогда
					СинонимРеквизита = Реквизит;
				Иначе
					СинонимРеквизита = НайденныйРеквизит.Представление();
				КонецЕсли;
				Текст = "Поле %1 не заполнено";
				Текст = СтрШаблон(Текст, СинонимРеквизита);
				ОбщегоНазначения.СообщитьПользователю(Текст);
				Результат = Ложь;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьТекстЗапросаПользователейСклад(ПоместитьВоВременнуюТаблицу = Ложь) Экспорт
	
	Текст =
	"ВЫБРАТЬ
	|	дкл_ПользователиСкладов.НастройкаСклада КАК НастройкаСклада,
	|	дкл_ПользователиСкладов.Пользователь КАК Пользователь,
	|	дкл_ПользователиСкладов.Роль КАК Роль,
	|	дкл_ПользователиСкладов.Активна КАК Активна,
	|	дкл_ПользователиСкладов.Статус КАК Статус,
	|	дкл_ПользователиСкладов.firstName КАК firstName,
	|	дкл_ПользователиСкладов.lastName КАК lastName,
	|	дкл_ПользователиСкладов.login КАК login,
	|	дкл_ПользователиСкладов.middleName КАК middleName,
	|	дкл_ПользователиСкладов.password КАК password,
	|	дкл_ПользователиСкладов.position КАК position,
	|	дкл_ПользователиСкладов.rfid КАК rfid,
	|	дкл_ПользователиСкладов.role КАК role,
	|	дкл_ПользователиСкладов.userId КАК userId
	|ИЗ
	|	РегистрСведений.дкл_ПользователиСкладов КАК дкл_ПользователиСкладов
	|ГДЕ
	|	дкл_ПользователиСкладов.НастройкаСклада = &НастройкаСклада";                                                       
	
	Если ПоместитьВоВременнуюТаблицу Тогда
		Текст = СтрЗаменить(Текст, "ИЗ", "ПОМЕСТИТЬ врПользователиСклада" + Символы.ПС + "ИЗ");		
		Текст = Текст + Символы.ПС + "ИНДЕКСИРОВАТЬ ПО	дкл_ПользователиСкладов.Пользователь.Пользователь";
	КонецЕсли;

	Возврат Текст;
	
КонецФункции

Функция ПолучитьРеквизитыПользователяСклада(ТекущаяСтрока) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Новый Структура;	
	
	Пользователь = ТекущаяСтрока.Пользователь;
	
	Если ЗначениеЗаполнено(Пользователь) Тогда
		 userId = Строка(Пользователь.УникальныйИдентификатор());
	 Иначе
		 userId = Строка(Новый УникальныйИдентификатор);
	КонецЕсли;
	
	Результат.Вставить("userId", Строка(Пользователь.УникальныйИдентификатор()));		
	
	Физлицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Пользователь, "ФизическоеЛицо");
	ФамилияИмяОтчество = ФизическиеЛицаУТ.ФамилияИмяОтчество(ФизЛицо, ТекущаяДатаСеанса());
	
	Результат.Вставить("lastName"	, ФамилияИмяОтчество.Фамилия);           
	Результат.Вставить("firstName"	, ФамилияИмяОтчество.Имя);
	Результат.Вставить("middleName"	, ФамилияИмяОтчество.Отчество);     
	Результат.Вставить("login"		, дкл_ОбщегоНазначенияСервер.Транслит(СокрЛП(ФамилияИмяОтчество.Фамилия)));           
	Результат.login = СтрЗаменить(Результат.login, " ", "");

	Результат.Вставить("position", "");	
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции // ()

Функция ЕстьПравоУправленияПолками(Пользователь, НастройкаСклада) Экспорт

	Если Пользователи.РолиДоступны("ПолныеПрава", Пользователь) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если НЕ ЕстьРольДляУправленияПолками(Пользователь) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	дкл_ПользователиСкладов.УправлениеЧерез1С КАК УправлениеЧерез1С
		|ИЗ
		|	РегистрСведений.дкл_ПользователиСкладов КАК дкл_ПользователиСкладов
		|ГДЕ
		|	дкл_ПользователиСкладов.НастройкаСклада = &НастройкаСклада
		|	И дкл_ПользователиСкладов.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("НастройкаСклада", НастройкаСклада);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
	ВыборкаДетальныеЗаписи.Следующий();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ВыборкаДетальныеЗаписи.УправлениеЧерез1С;
	
КонецФункции                                     

Функция ЕстьРольДляУправленияПолками(Пользователь) Экспорт
	
	Если Пользователи.РолиДоступны(
			"ПолныеПрава, дкл_Администратор, дкл_Оператор", Пользователь) Тогда
		Возврат Истина;
	КонецЕсли;

	Возврат Ложь;
	
КонецФункции                                     

Функция ПроверятьАвторизациюНаАСХ(НастройкаСклада, Пользователь = Неопределено, userId = Неопределено) Экспорт

	// проверяем всегда по пользователю...
	
	Если Пользователь = Неопределено Тогда
		Пользователь = Пользователи.ТекущийПользователь();	
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	дкл_ПользователиСкладов.ПроверятьАвторизациюНаАСХ КАК ПроверятьАвторизациюНаАСХ,
		|	дкл_ПользователиСкладов.userId КАК userId
		|ИЗ
		|	РегистрСведений.дкл_ПользователиСкладов КАК дкл_ПользователиСкладов
		|ГДЕ
		|	дкл_ПользователиСкладов.НастройкаСклада = &НастройкаСклада
		|	И дкл_ПользователиСкладов.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("НастройкаСклада", НастройкаСклада);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;	
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	// возвращаем...
	userId = ВыборкаДетальныеЗаписи.userId;
	
	Возврат ВыборкаДетальныеЗаписи.ПроверятьАвторизациюНаАСХ;

КонецФункции                                     

Процедура УдалитьСтроки(НастройкаСклада, МассивUserId) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	дкл_ПользователиСкладов.НастройкаСклада КАК НастройкаСклада,
		|	дкл_ПользователиСкладов.Пользователь КАК Пользователь,
		|	дкл_ПользователиСкладов.userId КАК userId
		|ИЗ
		|	РегистрСведений.дкл_ПользователиСкладов КАК дкл_ПользователиСкладов
		|ГДЕ
		|	дкл_ПользователиСкладов.НастройкаСклада = &НастройкаСклада
		|	И дкл_ПользователиСкладов.userId В(&userId)";
	
	Запрос.УстановитьПараметр("userId", МассивUserId);
	Запрос.УстановитьПараметр("НастройкаСклада", НастройкаСклада);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МенеджерЗаписи = РегистрыСведений.дкл_ПользователиСкладов.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ВыборкаДетальныеЗаписи);
		МенеджерЗаписи.Удалить();
	КонецЦикла;

	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры          

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьСотрудникаПоФизЛицу(ФизическоеЛицо) Экспорт

	Перем Сотрудник;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Сотрудники.Ссылка
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.ФизическоеЛицо = &ФизическоеЛицо
	//|	И Сотрудники.ГоловнаяОрганизация = &Организация
	|	И НЕ Сотрудники.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	
	//ToDo: что с организацией?
//	Запрос.УстановитьПараметр("Организация",    Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Сотрудник = Выборка.Ссылка;
	КонецЕсли;

	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Сотрудник;
	
КонецФункции

#КонецОбласти

#КонецЕсли
